tests/test_files/soap/SAM_doSearch_byName_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:impl="http://impl.services.screening.medicaid.gov/">
	<soapenv:Header />
	<soapenv:Body>
		<impl:doSearch>
			<!--Optional: -->
			<arg0>
				<!--Optional: -->
				<firstName>Dennis</firstName>
				<!--Optional: -->
				<lastName>Macabuhay</lastName>
				<!--Optional: -->
				<middleName>Ordonez</middleName>
				<!--Optional: -->
				<partialName />
			</arg0>
		</impl:doSearch>
	</soapenv:Body>
</soapenv:Envelope>